#ifndef JOYSTICKHAL_HPP
#define JOYSTICKHAL_HPP

/*======================================================== [INCLUDE LIBRARY] ===================================================*/
#include <stdlib.h>
#include <Arduino.h>
#include "PS4Controller.h"

/*========================================================= [CONFIGURATION] ====================================================*/

/*================================================= ( Các Miền giá trị của Joystick ) ==========================================*/

/** Miền Điều Khiển - Right Joystick
 - Tâm Joystick: [-5;5]
 - Miền điều khiển x^2 + y^2 <= 127^2 với x,y đều nằm trong khoảng = [-127;-5] hợp [5;127];
 */

/** Miền Set Thông Số - Left Joystick
 - Tâm Joystick: [-5;5]
 - Chỉ xét theo trục x và y:
 * Up: y = [100; 127] và x = [-100;100]
 * Down: y = [-127;-100] và x = [-100; 100]
 * Right: x = [100; 127] và y = [-100;100]
 * Left: x = [-127; -100] và y = [-100;100]
 */

/*============================================================= ( Set-Up ) =====================================================*/

const float SPEED = 0.5; // pixel mỗi chu kỳ
const int DEADZONE = 5;

/*============================================================= ( Tọa độ ) =====================================================*/

float x = 0, y = 0; // vị trí đầu bút hiện tại

struct PointData
{
    float x_old;
    float y_old;
    float x_new;
    float y_new
};

/*======================================================= ( Setup Vi điều khiển ) =============================================*/

void setupPS4();

/*======================================================= [FUNCTION INITIALIZATION] ===========================================*/

/*========================================================== ( Hàm Lấy Tọa độ ) ===============================================*/

PointData readPS4()

#endif